Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: But the GUI window is only opened after all the initializations have been carried out.
es_es: La ventana de la interfaz gráfica solo se abre después de llevar a cabo todas las órdenes de inicio.

source: If you want some commands to be executed just after opening the GUI window, use the |GUIEnter| autocommand event.
es_es: Si desea que alguna orden se ejecute justo después de abrir la ventana de la interfaz gráfica, use el evento de autorden |GUIEvent|.

source: Example: > :autocmd GUIEnter * winpos 100 50
es_es: Ejemplo: > :autocmd GUIEnter * winpos 100 50

source: There are a number of options which only have meaning in the GUI version of Vim.
es_es: Hay un número de opciones que solo tienen efecto en la versión GUI de Vim.

source: These are 'guicursor', 'guifont', 'guipty' and 'guioptions'.
es_es: Estos son 'guicursor', 'guifont', 'guipty' y 'guioptions'.

source: They are documented in |options.txt| with all the other options.
es_es: Están documentadas en |options.txt|, junto con el resto de opciones.

source: *usr_26.txt* For Vim version 7.3.
es_es: *usr_26.esx* Para Vim versión 7.3.

source: An editing task is hardly ever unstructured.
es_es: Rara vez, una tarea de edición carece de estructura.

source: A change often needs to be made several times.
es_es: A menudo tiene que realizar un cambio varias veces.

source: In this chapter a number of useful ways to repeat a change will be explained.
es_es: En este capítulo se muestran varias maneras útiles de repetir un cambio.

source: Visual mode is very handy for making a change in any sequence of lines.
es_es: El modo Visual es útil cuando desea modificar una secuencia de líneas.

source: You can see the highlighted text, thus you can check if the correct lines are changed.
es_es: Al poder ver el texto resaltado, puede revisar si las líneas a modificar lo han sido correctamente.

source: But making the selection takes some typing.
es_es: Pero hacer la selección conlleva teclear.

source: The "gv" command selects the same area again.
es_es: La orden «gv» selecciona la misma área otra vez.

source: This allows you to do another operation on the same text.
es_es: Esto le permite realizar otra acción sobre el texto seleccionado.

source: Suppose you have some lines where you want to change "2001" to "2002" and "2000" to "2001":
es_es: Suponga que tiene algunas líneas en las que desea cambiar «2001» a «2002» y «2000» a «2001»:

source: The financial results for 2001 are better ~ than for 2000.
es_es: Los resultados financieros de 2001 son mejores ~ que para el año 2000.

source: First change "2001" to "2002".
es_es: Primero cambie «2001» a ««2002».

source: Select the lines in Visual mode, and use: >
es_es: Seleccione las líneas en modo Visual y use: >

source: Now use "gv" to reselect the same text.
es_es: Use ahora «gv» para seleccionar otra vez el mismo texto.

source: It doesn't matter where the cursor is.
es_es: No importa donde está el cursor.

source: Then use ":s/2000/2001/g" to make the second change.
es_es: Use entonces «:s/2000/2001/g» para hacer el segundo cambio.

source: Obviously, you can repeat these changes several times.
es_es: Obviamente, puede repetir estos cambios varias veces.

source: Now press CTRL-A.
es_es: Ahora pulse Ctrl-A.

source: The year will be increased by one:
es_es: El año se incrementará en uno:

source: The financial results for 2002 are better ~ than for 2000.
es_es: Los resultados financieros de 2002 son mejores ~ que para el año 2000.

source: Adding more than one can be done by prepending the number to CTRL-A.
es_es: Es posible añadir más de uno si prefija un número a CTRL-A.

source: Suppose you have this list:
es_es: Suponga que tiene esta lista:

source: item four ~ 2.
es_es: cuarto elemento ~ 2.

source: item five ~ 3.
es_es: quinto elemento ~ 3.

source: item six ~
es_es: sexto elemento ~

source: The "1." will change to "4.".
es_es: El «1.» pasará a ser «4.».

source: Again, you can use "." to repeat this on the other numbers.
es_es: Otra vez, puede usar «.» para repetir la misma acción sobre otros números.

source: 7 plus one is 10?
es_es: ¿7 más 1 igual a 10?

source: What happened here is that Vim recognized "007" as an octal number, because there is a leading zero.
es_es: Lo que ha ocurrido es que Vim reconoció 007 como un número octal, ya que hay un cero precediendo el número.

source: This notation is often used in C programs.
es_es: Esta notación se usa a menudo en programas C.

source: If you do not want a number with leading zeros to be handled as octal, use this: >
es_es: Si no desea que un número con ceros a la izquierda se considere un número octal, use lo siguiente: >

source: :args *.c < This finds all C files and edits the first one.
es_es: :args *.c < Esto encuentra todos los archivos C y edita el primero.

source: Now you can perform a substitution command on all these files: >
es_es: Ahora puede realizar una orden de sustitución sobre todos estos archivos: >

source: The ":argdo" command takes an argument that is another command.
es_es: La orden «:argdo» toma otra orden como argumento.

source: That command will be executed on all files in the argument list.
es_es: Esta orden se ejecutará sobre todos los archivos en la lista de argumentos.

source: The "%s" substitute command that follows works on all lines.
es_es: La orden de sustitución «%s» a continuación afecta a todas las líneas.

source: It finds the word "x_cnt" with "\<x_cnt\>".
es_es: Busca la palabra «x_cnt» con «\<x_cnt\>».

source: The "\<" and "\>" are used to match the whole word only, and not "px_cnt" or "x_cnt2".
es_es: Los «\<» y «\>» se usan para encontrar sólo la palabra completa, y no «px_cnt» o «x_cnt2».

source: The flags for the substitute command include "g" to replace all occurrences of "x_cnt" in the same line.
es_es: Las opciones para la orden de sustitución incluyen «g» para reemplazar todas las apariciones de «x_cnt» en la misma línea.

source: The "e" flag is used to avoid an error message when "x_cnt" does not appear in the file.
es_es: La opción «e» se emplea para evitar un mensaje de error cuando «x_cnt» no está presente en el archivo.

source: Otherwise ":argdo" would abort on the first file where "x_cnt" was not found.
es_es: En caso contrar, «:argdo» se interrumpiría en el primer archivo en el que no se encontrase «x_cnt».

source: The "|" separates two commands.
es_es: La «|» separa dos órdenes.

source: The following "update" command writes the file only if it was changed.
es_es: La orden a continuación «update» escribe en el archivo sólo si éste cambió.

source: If no "x_cnt" was changed to "x_counter" nothing happens.
es_es: Si no se cambió ningún «x_cnt» a «x_counter» no ocurrirá nada.

source: There is also the ":windo" command, which executes its argument in all windows.
es_es: También dispone de la orden «:windo», que ejecuta su argumento en todas las ventanas.

source: And ":bufdo" executes its argument on all buffers.
es_es: «:bufdo» ejecuta su argumento en todos los búfers.

source: Be careful with this, because you might have more files in the buffer list than you think.
es_es: Sea cuidadoso con esto, porque puede que tenga más archivos de los que crea en su lista de búfers.

source: Check this with the ":buffers" command (or ":ls").
es_es: Revise esto con la orden «:buffers» (o «:ls»).

source: Suppose you have a lot of files in which you need to change the string "-person-" to "Jones" and then print it.
es_es: Suponga que tiene que cambiar la cadena «-persona-» a «Juan» en varios archivos, e imprimirlo después.

source: How do you do that?
es_es: ¿Como se hace?

source: One way is to do a lot of typing.
es_es: Una manera es teclear mucho.

source: The other is to write a shell script to do the work.
es_es: La otra es escribir un script de consola para hacer la tarea.

source: The Vim editor does a superb job as a screen-oriented editor when using Normal mode commands.
es_es: El editor Vim realiza un trabajo superlativo como un editor orientado a pantalla cuando usa las órdenes de modo Normal.

source: For batch processing, however, Normal mode commands do not result in clear, commented command files; so here you will use Ex mode instead.
es_es: Para un procesamiento en lotes, por otra parte, las órdenes de modo Normal no finalizan correctamente como archivos claros y comentados; para ello tiene que usar el modo Ex.

source: This mode gives you a nice command-line interface that makes it easy to put into a batch file.
es_es: Este modo ofrece una bonita interfaz de línea de órdenes que facilita su inserción en un archivo de lotes.

source: ("Ex command" is just another name for a command-line (:) command.) The Ex mode commands you need are as follows: >
es_es: («Orden Ex» es sólo otro nombre para una orden en la línea de órdenes («:»).) Las órdenes del modo Ex que necesita son las siguientes: >

source: You put these commands in the file "change.vim".
es_es: Ponga estas órdenes en el archivo «change.vim».

source: Now to run the editor in batch mode, use this shell script: >
es_es: Para ejecutar el editor en modo de lotes, ese este script de consola: >

source: The for-done loop is a shell construct to repeat the two lines in between, while the $file variable is set to a different file name each time.
es_es: El bucle for-done es una construcción de consola para repetir las dos líneas entre ellas, mientras que la variable $file es definida con un nombre diferente cada vez.

source: The second line runs the Vim editor in Ex mode (-e argument) on the file $file and reads commands from the file "change.vim".
es_es: La segunda línea inicia Vim en modo Ex (argumento «-e») en el archivo $file y lee las órdenes del archivo «change.vim».

source: The -s argument tells Vim to operate in silent mode.
es_es: El argumento «-s» le dice a Vim que opere en modo silencioso.

source: In other words, do not keep outputting the :prompt, or any other prompt for that matter.
es_es: En otras palabras, no mostrar «:prompt» (cuadro de diálogo interactivo), o cualquier otro diálogo.

source: The "lpr -r tempfile" command prints the resulting "tempfile" and deletes it (that's what the -r argument does).
es_es: La orden «lpr -r archivo_temporal» muestra el «archivo_temporal» resultante y lo elimina (esto es lo que hace el argumento «-r»).

source: Vim can read text on standard input.
es_es: Vim puede leer texto desde la entrada estándar.

source: Since the normal way is to read commands there, you must tell Vim to read text instead.
es_es: Debido a que esta es la manera normal de leer órdenes, tendrá que decirle a Vim que lea texto.

source: This is done by passing the "-" argument in place of a file.
es_es: Esto se hace introduciendo el argumento «-» en lugar de un archivo.

source: This allows you to edit the output of the "ls" command, without first saving the text in a file.
es_es: Esto permite editar la salida de la orden «ls», sin guardar primero el texto en un archivo.

source: If you use the standard input to read text from, you can use the "-S" argument to read a script: >
es_es: Si usa la entrada estándar para leer texto, puede usar el argumento «-S» para leer un script: >

source: < Note: "-s" has a different meaning when it is used without "-e".
es_es: < Nota: «-s» tiene un significado diferente cuando se usa sin «-e».

source: Here it means to source the "script" as Normal mode commands.
es_es: Aquí significa que tiene que cargar el script como si fueran órdenes de modo Normal.

source: When used with "-e" it means to be silent, and doesn't use the next argument as a file name.
es_es: «-e» significa modo silencioso, y no usa el siguiente argumento como un nombre de archivo.

source: The commands in "script" are executed like you typed them.
es_es: Las órdenes en «script» se ejecutan como los introdujo.

source: Don't forget that a line break is interpreted as pressing <Enter>.
es_es: No olvide que un salto de línea se interpreta como <Intro>.

source: In Normal mode that moves the cursor to the next line.
es_es: En modo Normal, desplaza el cursor a la siguiente línea.

source: To create the script you can edit the script file and type the commands.
es_es: Para crear el script, puede editar el archivo de script y teclear las órdenes.

source: You need to imagine what the result would be, which can be a bit difficult.
es_es: Necesita imaginar el resultado final, lo cual es un poco difícil.

source: Another way is to record the commands while you perform them manually.
es_es: Otra manera es grabar las órdenes al ejecutarlas manualmente.

source: This is how you do that: >
es_es: Así es como se hace: >

source: *usr_01.txt* For Vim version 7.3.
es_es: *usr_01.esx* Para Vim versión 7.3.

source: Last change: 2008 May 07
es_es: Último cambio: 7/6/2008

source: This chapter introduces the manuals available with Vim.
es_es: Este capítulo le introduce a los manuales disponibles con Vim.

source: Read this to know the conditions under which the commands are explained.
es_es: Lea esto para conocer las condiciones bajo las cuales se explican las órdenes.

source: The User manual Task oriented explanations, from simple to complex.
es_es: El manual de usuario Explicaciones orientadas a tareas, de las simples a las más complejas.

source: Reads from start to end like a book.
es_es: Se puede leer de principio a fin, como un libro.

source: The Reference manual Precise description of how everything in Vim works.
es_es: El manual de referencia Una precisa descripción del funcionamiento de cada elemento dentro de Vim.

source: The text contains hyperlinks between the two parts, allowing you to quickly jump between the description of an editing task and a precise explanation of the commands and options used for it.
es_es: El texto contiene hiperenlaces entre las dos partes, lo cual le permite saltar rápidamente de la descripción de una tarea de edición a una precisa explicación de las órdenes y opciones que se emplean.

source: Use these two commands:
es_es: Use estas dos órdenes:

source: Press CTRL-] to jump to a subject under the cursor.
es_es: Pulse «CTRL-]» para saltar al tema bajo el cursor.

source: Press CTRL-O to jump back (repeat to go further back).
es_es: Pulse «CTRL-O» para saltar atrás (repita para volver más allá de ese punto).

source: Many links are in vertical bars, like this: |bars|.
es_es: Hay varios enlaces entre barras verticales, como este: |bars|.

source: An option name, like 'number', a command in double quotes like ":write" and any other word can also be used as a link.
es_es: También puede usar como enlace un nombre de opción, como 'number', una orden entrecomillada, como «:write», o cualquier otra palabra.

source: Try it out: Move the cursor to CTRL-] and press CTRL-] on it.
es_es: Pruebelo: mueva el cursor a «CTRL-]» y pulse «CTRL-]» sobre él.

source: If you start Vim now, the 'compatible' option should be off.
es_es: Si inicia ahora Vim, la opción 'compatible' debería estar desactivada.

source: You can check it with this command: >
es_es: Puede asegurarse con esta orden: >

source: If it responds with "nocompatible" you are doing well.
es_es: Si devuelve "nocompatible", es que todo va bien.

source: If the response is "compatible" you are in trouble.
es_es: Si la respuesta es «compatible», tiene un problema.

source: You will have to find out why the option is still set.
es_es: Tendrá que encontrar porqué esta opción está aún definida.

source: Perhaps the file you wrote above is not found.
es_es: Puede que no se encontrase el archivo que copió antes.

source: Use this command to find out: >
es_es: Use esta orden para ver el problema: >

source: If your file is not in the list, check its location and name.
es_es: Si su archivo no se encuentra en la lista, revise su nombre y ubicación.

source: If it is in the list, there must be some other place where the 'compatible' option is switched back on.
es_es: Si está en la lista, debe haber algún otro sitio en el que se reactiva la opción 'compatible'.

source: Note: This manual is about using Vim in the normal way.
es_es: Nota: Este manual trata acerca del uso de Vim de la manera normal.

source: There is an alternative called "evim" (easy Vim).
es_es: Existe una alternativa llamada «evim» (easy Vim).

source: This is still Vim, but used in a way that resembles a click-and-type editor like Notepad.
es_es: Sigue siendo Vim, pero se usa de una manera parecida a un editor como Notepad.

source: It always stays in Insert mode, thus it feels very different.
es_es: Permanece siempre en el modo Insertar, y por ello parece muy distinto.

source: It is not explained in the user manual, since it should be mostly self explanatory.
es_es: No se explica en el manual de usuario, ya que es bastante sencillo.

source: See |evim-keys| for details.
es_es: Véase |evim-keys| para más detalles.

source: Instead of reading the text (boring!) you can use the vimtutor to learn your first Vim commands.
es_es: En lugar de leer el texto (¡aburre!), puede usar vimtutor para aprender sus primeras órdenes con Vim.

source: This is a 30 minute tutorial that teaches the most basic Vim functionality hands-on.
es_es: Éste es un tutorial de treinta minutos que enseña las funcionalidades básicas de Vim a través de la práctica.

source: On MS-Windows you can find it in the Program/Vim menu.
es_es: En MS-Windows, lo encontrará en el menú Programas/Vim.

source: Or execute vimtutor.bat in the $VIMRUNTIME directory.
es_es: O puede ejecutar «vimtutor.bat» en el directorio $VIMRUNTIME.

source: This will make a copy of the tutor file, so that you can edit it without the risk of damaging the original.
es_es: Esto crea una copia del archivo del tutor, para que así pueda editarlo sin peligro de dañar el original.

source: There are a few translated versions of the tutor.
es_es: Existen unas cuantas versiones traducidas del tutor.

source: To find out if yours is available, use the two-letter language code.
es_es: Para ver si el suyo está disponible, use el código de idioma de dos letras.

source: For French: >
es_es: Para el francés: >

source: Copy the tutor file.
es_es: Copie el archivo del tutor.

source: You can do this with Vim (it knows where to find it): > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor' -c 'w!
es_es: Puede hacer esto con Vim (sabe donde encontrarlo): > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor' -c 'w!

source: TUTORCOPY' -c 'q' < This will write the file "TUTORCOPY" in the current directory.
es_es: TUTORCOPY' -c 'q' < Esto copia el archivo «TUTORCOPY» al directorio actual.

source: To use a translated version of the tutor, append the two-letter language code to the filename.
es_es: Para usar una versión traducida del tutor, afije el código de idioma al nombre del archivo.

source: For French: > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor.fr' -c 'w!
es_es: Para francés: > vim -u NONE -c 'e $VIMRUNTIME/tutor/tutor.fr' -c 'w!

source: Edit the copied file with Vim: > vim -u NONE -c "set nocp" TUTORCOPY < The extra arguments make sure Vim is started in a good mood.
es_es: Edite la copia del archivo con Vim: > vim -u NONE -c "set nocp" TUTORCOPY < Los argumentos extra se aseguran de que Vim se inicie adecuadamente:

source: Delete the copied file when you are finished with it: > del TUTORCOPY < ==============================================================================
es_es: Borrar el archivo copiado cuando haya acabado con él: > del TUTORCOPY ==============================================================================

source: The Vim user manual and reference manual are Copyright (c) 1988-2003 by Bram Moolenaar.
es_es: El manual de usuario y el manual de referencia están bajo el Copyright (c) 1988-2003 por Bram Moolenaar.

source: This material may be distributed only subject to the terms and conditions set forth in the Open Publication License, v1.0 or later.
es_es: Este material se distribuirá sólo bajo estos términos de licencia y condiciones expuestas en la Open Publication License, versión 1.0 o posterior.

source: The latest version is presently available at: http://www.opencontent.org/openpub/
es_es: La versión más actual está ahora disponible en: http://www.opencontent.org/openpub/

source: People who contribute to the manuals must agree with the above copyright notice.
es_es: Las personas que contribuyan al manual también tienen que aceptar el copyright expuesto anteriormente.

source: *frombook* Parts of the user manual come from the book "Vi IMproved - Vim" by Steve Oualline (published by New Riders Publishing, ISBN: 0735710015).
es_es: *frombook* Hay partes del manual de usuario que proceden del libro «Vi IMproved - Vim», por Steve Oualline (publicado por New Riders Publishing, ISBN: 0735710015).

source: The Open Publication License applies to this book.
es_es: La Open Publication License también cubre a este libro.

source: Only selected parts are included and these have been modified (e.g., by removing the pictures, updating the text for Vim 6.0 and later, fixing mistakes).
es_es: Sólo se incluyen partes seleccionadas, y estas se han modificado (p. ej. se eliminaron las fotos, se actualizó el texto para Vim 6.0 y posteriores, corrección de errata).

source: The omission of the |frombook| tag does not mean that the text does not come from the book.
es_es: La omisión de la etiqueta |frombook| no significa que el texto no proceda del libro.

source: Many thanks to Steve Oualline and New Riders for creating this book and publishing it under the OPL!
es_es: ¡Muchas gracias a Steve Oualline y a New Riders por crear este libro, y publicarlo bajo la licencia OPL!

source: It has been a great help while writing the user manual.
es_es: Ha servido de gran ayuda a la hora de escribir este manual.

source: Not only by providing literal text, but also by setting the tone and style.
es_es: No sólo por el texto literal, sino también al definir el tono y estilo.

source: If you make money through selling the manuals, you are strongly encouraged to donate part of the profit to help AIDS victims in Uganda.
es_es: Si obtiene beneficios mediante la venta de los manuales, le animamos a que done parte de los beneficios para ayudar a las victimas del SIDA en Uganda.

source: See |iccf|.
es_es: Véase |iccf|.

source: *usr_07.txt* For Vim version 7.3.
es_es: *usr_07.esx* Para Vim version 7.3.

source: No matter how many files you have, you can edit them without leaving Vim.
es_es: No importa cuántos archivos tenga, puede editarlos todos sin salir de Vim.

source: Define a list of files to work on and jump from one to the other.
es_es: Defina una lista de archivos de trabajo y pase de uno a otro.

source: Copy text from one file and put it in another one.
es_es: Copie texto de un archivo a otro.

source: You can use any file name instead of "foo.txt".
es_es: Puede usar cualquier nombre de archivo en lugar de «foo.txt».

source: Vim will close the current file and open the new one.
es_es: Vim cerrará el archivo actual y abrirá uno nuevo.

source: If the current file has unsaved changes, however, Vim displays an error message and does not open the new file:
es_es: Sin embargo, si el archivo actual tiene cambios no guardados, Vim mostrará un error y no abrirá el archivo nuevo:

source: Note: Vim puts an error ID at the start of each error message.
es_es: Nota: Vim coloca una ID de error al comienzo de cada mensaje de error.

source: If you do not understand the message or what caused it, look in the help system for this ID.
es_es: Si no entiende el mensaje o su causa, puedes buscar ayuda para esta ID.

source: In this case: >
es_es: En este caso: >

source: At this point, you have a number of alternatives.
es_es: En este punto, dispone de una serie de alternativas.

source: You can write the file using this command: >
es_es: Puede escribir el archivo usando esta orden: >
